Revit 2027 API
Transform.Multiply Method
Multiplies this transformation by the specified transformation and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform Multiply(
	Transform right
)
Public Function Multiply (
	right As Transform
) As Transform
public:
Transform^ Multiply(
	Transform^ right
)
member Multiply :
        right : Transform -> Transform
Parameters
right Transform
The specified transformation.
Return Value
Transform
The transformation equal to the composition of the two transformations.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the handle of the specified transformation is null.
Remarks
 The combined transformation has the same effect as applying the right transformation first, and the left transformation, second. So, (T1(T2(p)) = (T1 * T2) (p).
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace